csi-induction_2D/openfoam_template_steady/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      transportProperties;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

transportModel Newtonian;

// CSI
// Density                  3200 kg/m^3
// dynamic viscosity        2e-3 kg/m/s
// kinematic viscosity      6.25e-7 m^2/s
// thermal expansion        3.7e-4 1/K
// specific heat capicity   230 J/kg/K
// heat conductivity        8.4 W/m/K
// Pr = mu*cp/k

// Laminar viscosity
nu              6.25e-7;

// Thermal expansion coefficient
beta            3.70e-4; 

// Reference temperature
TRef            900.0;

// Laminar Prandtl number  
Pr              0.0548; 

// Turbulent Prandtl number
Prt             0.85;


// ************************************************************************* //
