csi-induction_2D/openfoam_template_steady/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p_rgh
    {
        solver          PCG;
        preconditioner  DIC;
	minIter		3;
        tolerance       1e-8;
        relTol          0.01;
    }

    "(U|T|C1|C2|k|epsilon|R)"
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-8;
        relTol          0.0;
    }

}

SIMPLE
{
    //momentumPredictor           false;
    nNonOrthogonalCorrectors    2;
    pRefCell                    0;
    pRefValue                   0;

    residualControl
    {
        p_rgh           1e-4;
        U               1e-4;
        T               1e-4;

        // possibly check turbulence fields
        //"(k|epsilon|omega)" 1e-3;
    }
    
}
//residualControl
//{
//      p_rghFinal
//      {
//          tolerance 1e-2;
//          relTol    0;
//          absTol    0;
//      }
//}

relaxationFactors
{
    fields
    {
        p_rgh           0.7;
    }
    equations
    {
        U               0.7;
        T               1;
        "(k|epsilon|R)" 0.7;
    }
}
// ************************************************************************* //
